app/controllers/genres_controller.rb

  def create
    @genre = Genre.new(genre_params)
    if @genre.save
---
INSERT INTO "genres" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-01-11 19:23:54.005431"], ["name", "Avant Garde"], ["updated_at", "2016-01-11 19:23:54.005431"]]