app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "movies" SET "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = 7  [["image_file_name", "http://ia.media-imdb.com/images/M/MV5BMTAwMjU5OTgxNjZeQTJeQWpwZ15BbWU4MDUxNDYxODEx._V1_SX67_CR0,0,67,98_AL_.jpg"], ["updated_at", "2015-03-15 19:36:42.677926"]]